#+AUTHOR: Kuntima K.
#+DESCRIPTION: My personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

** PYTHON
#+begin_src emacs-lisp
(use-package elpy
  :commands elpy-enable)

(use-package jedi
  :hook (python-mode . jedi:setup)
  :config (setq jedi:complete-on-dot t))

(use-package company-jedi
  :after company
  :hook (python-mode . (lambda ()
                         (add-to-list 'company-backends 'company-jedi))))
#+end_src

#+RESULTS:
| (lambda nil (add-to-list 'company-backends 'company-jedi)) | (lambda nil (if (member 'company-jedi company-backends) company-backends (setq company-backends (cons 'company-jedi company-backends)))) | jedi:setup |

** C / C++
#+begin_src emacs-lisp
          ;; Modern C++ syntax highlighting
              (use-package modern-cpp-font-lock
                :ensure t
                :hook (c++-mode . modern-cpp-font-lock-mode))

          ;; Company (completion)
              (use-package company
                :ensure  t
                :hook (after-init . global-company-mode)
                :config
                (setq company-idle-delay 0.2
                      company-minimum-prefix-length 1))

      ;; Company backend for C headers
      ;; -----------------------------
      (use-package company-c-headers
        :ensure t
        :after company
        :config
        (add-to-list 'company-backends 'company-c-headers)
        ;; Set system include paths for GCC
        (setq company-c-headers-path-system
              '("/usr/include/c++/11"
                "/usr/include/x86_64-linux-gnu/c++/11"
                "/usr/include")))


              (use-package auto-complete
                :ensure t
                :config
                (ac-config-default)
                (global-auto-complete-mode t))

              (use-package flycheck
                :ensure t
                :hook (after-init . global-flycheck-mode)
                :config
                (setq flycheck-gcc-language-standard "c++17"
                      flycheck-gcc-include-path '("/usr/include"
                                                  "/usr/local/include")))

              (global-flycheck-mode)
              (require 'flycheck-pyflakes) 

              (use-package cmake-ide
                :commands (cmake-ide-compile cmake-ide-setup)
                :config
                (setq cmake-ide-flags-c++ '("-std=c++17")))

            (global-set-key (kbd "<f5>") 'compile)
              (use-package cuda-mode
                :mode "\\.cu\\'")


      (add-hook 'after-init-hook 'global-company-mode)
      ;; Snippets
(use-package yasnippet
  :ensure t
  :config
  (yas-global-mode 1))



#+end_src

#+RESULTS:
| global-flycheck-mode | global-company-mode | org-persist-load-all | tramp-register-archive-autoload-file-name-handler | table--make-cell-map |

** PATH FIX
#+begin_src emacs-lisp
(defun set-exec-path-from-shell-PATH ()
  "Sync exec-path with shell PATH."
  (let ((path-from-shell
         (string-trim (shell-command-to-string "$SHELL -l -c 'echo $PATH'"))))
    (setenv "PATH" path-from-shell)
    (setq exec-path (split-string path-from-shell path-separator))))
(set-exec-path-from-shell-PATH)
#+end_src

#+RESULTS:
| /home/kuntima/.local/bin | /usr/local/sbin | /usr/local/bin | /usr/sbin | /usr/bin | /sbin | /bin | /usr/games | /usr/local/games | /snap/bin |

** AGENDA PATH
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files '("~/.config/emacs/"))
#+END_SRC

#+RESULTS:
| ~/.config/emacs/ |
